In [4]:
import pandas as pd
import numpy as np
import matplotlib as mlt

In [6]:
a={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(a)
df['State']='CA NV AZ'.split()
df.set_index('State',inplace=True)

In [7]:
df

         A    B  C
State
CA     1.0  5.0  1
NV     2.0  NaN  2
AZ     NaN  NaN  3

Fill NA

In [8]:
df.fillna(value='sudh')

          A     B  C
State
CA        1     5  1
NV        2  sudh  2
AZ     sudh  sudh  3

In [9]:
df.fillna(value='99')

        A   B  C
State
CA      1   5  1
NV      2  99  2
AZ     99  99  3

In [11]:
df.fillna(value=df['A'].mean())

         A    B  C
State
CA     1.0  5.0  1
NV     2.0  1.5  2
AZ     1.5  1.5  3

GroupBy operation

In [46]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [34]:
#finding average of sale based on company
by_company=df.groupby('Company')
print('Grouping based on company and then finding the sales average\n','-'*55,sep=' ')
print(by_company.mean())

Grouping based on company and then finding the sales average
 -------------------------------------------------------
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [35]:
#finding description based on companies
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [61]:
by_company=df.groupby('Company')
print('Grouping based on company and then finding the sales average\n','-'*55,sep=' ')
print(by_company.mean().loc[['MSFT','GOOG']])
print('\n','-'*55)
print(by_company.std().loc[['MSFT','GOOG']])

Grouping based on company and then finding the sales average
 -------------------------------------------------------
         Sales
Company
MSFT     232.0
GOOG     160.0

 -------------------------------------------------------
              Sales
Company
MSFT     152.735065
GOOG      56.568542

In [57]:
by_company.std().loc[['GOOG','FB']]

             Sales
Company
GOOG     56.568542
FB       75.660426

In [63]:
std_dev=by_company.std().loc[['MSFT','GOOG']]
std_dev

              Sales
Company
MSFT     152.735065
GOOG      56.568542

In [68]:
df.groupby('Company').describe().iloc[1:3,1:3]

         Sales
          mean         std
Company
GOOG     160.0   56.568542
MSFT     232.0  152.735065

In [75]:
df.iloc[1:5,0:3]

  Company   Person  Sales
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243